/* 
    Задание 1:

    Вывести в консоль с помощью цикла FOR все четные числа от 10 до 50
*/
for (var i = 10; i <= 50; i++){
    console.log(i);
}
/* 
    Задание 2:

    Необходимо создать объект в котором вы опишите самого себя в формате : "свойство: значение"

    Список свойств:

    - Имя(string)
    - Фамилия(string)
    - Возраст(number)
    - Есть ли домашние животные(boolean)
*/

const me = {
    name: "Mariya",
    lastName: "Turetska",
    age: 16,
    pet: true
}

/* 
    Задание 3:

    Отрывок из текста А.С Пушкин, Капитанская дочка был разбит на небольшие кусочки и помещен в массив. 
    Необходимо собрать этот текст из массива и придать ему первоначальный вид.

    Текст до разбивки на части:

    "В ту же ночь приехал я в Симбирск, где должен был пробыть сутки для закупки нужных вещей,
    что и было поручено Савельичу. Я остановился в трактире. Савельич с утра отправился по лавкам"

    Массив: 
    const array = [
        'я в Симбирск,',
        'в трактире.',
        'с утра',
        'В ту же ночь',
        'Я остановился',
        'для закупки', 
        'что и было поручено Савельичу.',
        'приехал,',
        'где должен был',
        'нужных вещей',
        'отправился по лавкам',
        'пробыть сутки',
        'Савельич'
    ]

   итоговый текст должен быть собран из массива array и результат записать в переменную result
*/
const array = [
    'я в Симбирск,',
    'в трактире.',
    'с утра',
    'В ту же ночь',
    'Я остановился',
    'для закупки', 
    'что и было поручено Савельичу.',
    'приехал,',
    'где должен был',
    'нужных вещей',
    'отправился по лавкам',
    'пробыть сутки',
    'Савельич'
]

// "В ту же ночь приехал я в Симбирск, где должен был пробыть сутки для закупки нужных вещей,
//что и было поручено Савельичу. Я остановился в трактире. Савельич с утра отправился по лавкам"

var result = array[3].concat(" ").concat(array[7]).concat(" ").concat(array[0]).concat(" ").concat(array[8]).concat(" ").concat(array[11]).concat(" ").concat(array[5]).concat(" ").concat(array[9]).concat(" ").concat(array[6]).concat(" ").concat(array[4]).concat(" ").concat(array[1]).concat(" ").concat(array[12]).concat(" ").concat(array[2]).concat(" ").concat(array[10]);

console.log(result);
/* 
    Задание 4:

    Напишите функцию, в теле которой будет находится следующий код:

    const fullName = `${firstName} ${lastName}`;
    console.log(fullName);

    firstName и lastName - это параметры функции

    При вызове функции передайте ей, в качестве аргумента, свое имя и фамилию.
*/
const nameFunction = (firstName, lastName) => {
    const fullName = `${firstName} ${lastName}`;
    console.log(fullName);
}

nameFunction("Mariya", "Turetska");
/* 
    Задание 5:

    Вывести в консоль с помощью цикла WHILE все нечетные числа от 21 до 67
    
*/
let  x = 20;
while ((20 <= x) && (x < 67)){
    x++;
    if(x % 2 !== 0){
        console.log(x)
    }
}